<script setup lang="ts">
defineEmits<{ (e: "onclick"): void }>();
</script>

<template>
  <div
    class="w-full sm:w-48/100 lg:w-32/100 xl:w-24/100 flex flex-col gap-3 cursor-pointer"
    @click="$emit('onclick')"
  >
    <div class="h-50 w-full bg-gray-200 rounded-lg animate-pulse" />
    <div class="flex flex-col gap-2">
      <h5 class="font-montserrat font-semibold text-xl">Ищу соседа!</h5>
      <p class="line-clamp-4 leading-5">
        Ищем соседа в уютную 2-комнатную квартиру в центре! Чистый, свежий
        ремонт, вся мебель и техника есть. Желательно аккуратный, некурящий и
        без животных. Оплата 50/50 + коммуналка. Рядом метро, магазины и парк.
        Если ты спокойный, ответственный и любишь порядок — давай знакомиться!
        😊
      </p>
    </div>
  </div>
</template>
